
'''
题目描述
    小明负责公司年会，想出一个趣味游戏：
    屏幕给出 1 ~ 9 中任意 4 个不重复的数字，
    大家以最快时间给出这几个数字可拼成的数字从小到大排列位于第 N 位置的数字，
    其中 N 为给出数字中最大的（如果不到这么多数字则给出最后一个即可）。

注意：
    2 可以当作 5 来使用，5 也可以当作 2 来使用进行数字拼接，且屏幕不能同时给出 2 和 5；
    6 可以当作 9 来使用，9 也可以当作 6 来使用进行数字拼接，且屏幕不能同时给出 6 和 9。
如给出：1，4，8，7，则可以拼接的数字为：
    1，4，7，8，14，17，18，41，47，48，71，
    74，78，81，84，87，147，148，178 … (省略后面的数字)
那么第 N （即8）个的数字为 41。

输入描述
    输入以逗号分隔的 4 个 int 类型整数的字符串。
输出描述
    输出为这几个数字可拼成的数字从小大大排列位于第 N （N为输入数字中最大的数字）位置的数字，
    如果输入的数字不在范围内或者有重复，则输出-1。

示例1
    输入
        1,4,8,7
    输出
        41
    说明
        可以构成的数字按从小到大排序为：
            1，4，7，8，14，17，18，41，47，48，71，74，
            78，81，84，87，147，148，178 … （省略后面的数字），
        故第8个为41
示例2
    输入
        2,5,1
    输出
        -1
    说明
        2和5不能同时出现
示例3
    输入
        3,0,9
    输出
        -1
    说明
        0不在1到9范围内
示例4
    输入
        3,9,7,8
    输出
        39
    说明
        注意9可以当6使用，所以可以构成的数字按从小到大排序为：
        3，6，7，8，9，36，37，38，39，
        63，67，68，73，76，78，79，83 … （省略后面的数字），
        故第9个为39
'''