
'''
题目描述
    给你一个字符串 s，字符串s首尾相连成一个环形 ，
    请你在环中找出’l’、‘o’、‘x’ 字符都恰好出现了偶数次最长子字符串的长度。
输入描述
    输入是一串小写的字母组成的字符串s。
    1 <= s.length <= 5 x 10^5
    s 只包含小写英文字母。
输出描述
    输出是一个整数
用例1
    输入
        alolobo
    输出
        6
    说明：
        最长子字符串之一是 “alolob”，它包含 ‘l’，'o’各 2 个，以及 0 个 ‘x’ 。
用例2
    输入
        looxdolx
    输出
        7
    说明
        最长子字符串是 “oxdolxl”，由于是首尾连接在一起的，
        所以最后一个 ‘x’ 和开头的 'l’是连接在一起的，
        此字符串包含 2 个 ‘l’ ，2个 ‘o’ ，2个 ‘x’ 。`
用例3
    输入
        bcbcbc
    输出
        6
    说明
        字符串 “bcbcbc” 本身就是最长的，因为 ‘l’、‘o’、‘x’ 都出现了 0 次。
'''

